// Status: PARTIAL - JNT native encryption (strings in jnt.so)

import java.lang.invoke.MethodHandle;
import java.lang.invoke.MethodType;
import java.lang.invoke.MutableCallSite;
import java.lang.invoke.MethodHandles.Lookup;

public enum q {
  ux,
  th,
  cou,
  sdd,
  evs;
  // [JNT] MethodHandle dispatch table (removed)
  // $VF: Failed to inline enum fields
  // Please report this to the Vineflower issue tracker, at https://github.com/Vineflower/vineflower/issues with a copy of the class file (if you have the rights to distribute it!)
  static {
    int var10000 = 1502660923 + 1502660923 ^ -1289645450;

    StringBuilder var10001;
    for (var10001 = (StringBuilder)/* jnt */;
      var10000 < ((884903721 ^ 1956870946 | 16) & 520227056);
      var10000 += 427971554 - -41636836 * -951829011 ^ 1295798775
    ) {
      int var18 = /* jnt */
          + '9'
        ^ 123
        ^ 2;
      int var10004 = (var18 & 65024) >> 9;
      int var19 = (var18 & 65024) >> 9 | var18 << 7;
      int var44 = (((var18 & 65024) >> 9 | var18 << 7) & 65024) >> 9;
      char var20 = (char)(((var10004 | var18 << 7) & 65024) >> 9 | ((var18 & 65024) >> 9 | var18 << 7) << 7);
      /* jnt */(var44 | var19 << 7)
      );
    }

    ux = (q)/* jnt */,
      0
    );
    var10000 = (1435291217 >>> 1435291217 | 0) & 1965625392;

    for (var10001 = (StringBuilder)/* jnt */;
      var10000 < ((1450783558 + (2050197358 >> -1893718029) | 0) & 5432);
      var10000 += (-747030886 | 811133878 + -1238289509 | 0) & 134234113
    ) {
      int var23 = /* jnt */
        + 'a';
      char var24 = (char)((((var23 & 61440) >> 12 | var23 << 4) - 122 ^ 141) - 168);
      /* jnt */((((var23 & 61440) >> 12 | var23 << 4) - 122 ^ 141) - 168)
      );
    }

    th = (q)/* jnt */,
      1
    );
    var10000 = (1073994774 | -1147715129 << 834186032 | 0) & 838861161;

    for (var10001 = (StringBuilder)/* jnt */;
      var10000 < (1054152568 >>> (547418848 ^ 1054152568 >>> 547418848) ^ 49);
      var10000 += (-1682512198 | 1401761310) ^ -608178497
    ) {
      char var27 = /* jnt */;
      char var30 = (char)(
        ((((((var27 & '\uf000') >> 12 | var27 << 4) + 77 ^ 254) & 65024) >> 9 | (((var27 & '\uf000') >> 12 | var27 << 4) + 77 ^ 254) << 7) & 65520) >> 4
          | (((((var27 & '\uf000') >> 12 | var27 << 4) + 77 ^ 254) & 65024) >> 9 | (((var27 & '\uf000') >> 12 | var27 << 4) + 77 ^ 254) << 7) << 12
      );
      /* jnt */(
          ((((((var27 & '\uf000') >> 12 | var27 << 4) + 77 ^ 254) & 65024) >> 9 | (((var27 & '\uf000') >> 12 | var27 << 4) + 77 ^ 254) << 7) & 65520) >> 4
            | (((((var27 & '\uf000') >> 12 | var27 << 4) + 77 ^ 254) & 65024) >> 9 | (((var27 & '\uf000') >> 12 | var27 << 4) + 77 ^ 254) << 7) << 12
        )
      );
    }

    cou = (q)/* jnt */,
      2
    );
    var10000 = 1107120424 & -243619723 ^ 1098383392;

    for (var10001 = (StringBuilder)/* jnt */;
      var10000 < (-326019331 << -356197535 * -448390258 ^ 1438597125);
      var10000 += (-1770752358 | -1092525848) ^ -1091209477
    ) {
      /* jnt */(
          (
              /* jnt */
                  - '?'
                  - 15
                ^ 222
            )
            - 236
            + 93
        )
      );
    }

    sdd = (q)/* jnt */,
      3
    );
    var10000 = (1113946775 | 1113946775) ^ 1113946775;

    for (var10001 = (StringBuilder)/* jnt */;
      var10000 < ((1523506689 >>> 1523506689 | 8) & 1384124524);
      var10000 += (-996850319 + 815139676 | 1) & 42994707
    ) {
      int var35 = /* jnt */
          - 225
          - 47
        ^ 175;
      char var36 = (char)(((var35 & 65408) >> 7 | var35 << 9) ^ 13);
      /* jnt */(((var35 & 65408) >> 7 | var35 << 9) ^ 13)
      );
    }

    evs = (q)/* jnt */,
      4
    );
  }

  public static Object _/* $VF was: 0*/(Lookup var0, String var1, MethodType var2, Object... var3) {
    int var10 = (Integer)var3[4];
    int var10001 = ((var10 ^ 1716078618 ^ 1345565859) - 829703583 - 1711963293 + 1582877765 ^ 1093506668) - 943610245 + 760973351 ^ 1386263893;
    MethodHandle var10000 = cot[((var10 ^ 1716078618 ^ 1345565859) - 829703583 - 1711963293 + 1582877765 ^ 1093506668) - 943610245 + 760973351
      ^ 1386263893
      ^ 946958772];
    if (cot[var10001 ^ 946958772] == null) {
      int var4 = (Integer)var3[0];
      StringBuilder var13 = new StringBuilder((String)var3[1]);

      for (int var23 = -1998298439 >> -1998298439 ^ -60; var23 < var13.length(); var23 += (-340827601 >> -1451910450 | 0) & 16641) {
        int var42 = var13.charAt(var23);
        int var10004 = (var42 & 65532) >> 2;
        int var43 = (((var42 & 65532) >> 2 | var42 << 14) ^ 246) + 151;
        int var87 = ((((var42 & 65532) >> 2 | var42 << 14) ^ 246) + 151 & 63488) >> 11;
        var42 = ((((var10004 | var42 << 14) ^ 246) + 151 & 63488) >> 11 | (((var42 & 65532) >> 2 | var42 << 14) ^ 246) + 151 << 5) - 220 + 55 + 148 ^ 151;
        var10004 = (((var87 | var43 << 5) - 220 + 55 + 148 ^ 151) & 65472) >> 6;
        int var45 = (((var87 | var43 << 5) - 220 + 55 + 148 ^ 151) & 65472) >> 6 | var42 << 10;
        int var89 = (((((var87 | var43 << 5) - 220 + 55 + 148 ^ 151) & 65472) >> 6 | var42 << 10) & 65408) >> 7;
        char var46 = (char)(((var10004 | var42 << 10) & 65408) >> 7 | ((((var87 | var43 << 5) - 220 + 55 + 148 ^ 151) & 65472) >> 6 | var42 << 10) << 9);
        var13.setCharAt(var23, (char)(var89 | var45 << 9));
      }

      String var5 = var13.toString();
      StringBuilder var16 = new StringBuilder((String)var3[2]);

      for (int var29 = -1915515771 ^ (-1069813609 | -1069813609) ^ 1307081746; var29 < var16.length(); var29 += 826498070 >> 826498070 ^ 196) {
        int var51 = var16.charAt(var29);
        int var90 = (var51 & 65520) >> 4;
        int var52 = ((var51 & 65520) >> 4 | var51 << 12) + 116 - 86 - 197;
        int var91 = (((var51 & 65520) >> 4 | var51 << 12) + 116 - 86 - 197 & 64512) >> 10;
        var51 = ((var90 | var51 << 12) + 116 - 86 - 197 & 64512) >> 10 | ((var51 & 65520) >> 4 | var51 << 12) + 116 - 86 - 197 << 6;
        var90 = ((var91 | var52 << 6) & 65520) >> 4;
        int var54 = (((var91 | var52 << 6) & 65520) >> 4 | var51 << 12) - 116;
        int var93 = ((((var91 | var52 << 6) & 65520) >> 4 | var51 << 12) - 116 & 64512) >> 10;
        char var55 = (char)((((var90 | var51 << 12) - 116 & 64512) >> 10 | (((var91 | var52 << 6) & 65520) >> 4 | var51 << 12) - 116 << 6) - 130 ^ 37);
        var16.setCharAt(var29, (char)((var93 | var54 << 6) - 130 ^ 37));
      }

      MethodType var6 = MethodType.fromMethodDescriptorString(var16.toString(), q.class.getClassLoader());
      StringBuilder var19 = new StringBuilder((String)var3[3]);

      for (int var35 = -140251529 * 631507715 ^ -379131803;
        var35 < var19.length();
        var35 += (-158370509 * -158370509 * -158370509 * -158370509 | 0) & 213917989
      ) {
        char var60 = var19.charAt(var35);
        char var65 = (char)(
          (
              (
                    (
                        (
                              (
                                  ((((((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) & 0) >> 16 | (((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) << 0) + 18 & 32768) >> 15
                                    | (((((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) & 0) >> 16 | (((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) << 0) + 18 << 1
                                )
                                & 65532
                            )
                            >> 2
                          | (
                              ((((((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) & 0) >> 16 | (((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) << 0) + 18 & 32768) >> 15
                                | (((((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) & 0) >> 16 | (((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) << 0) + 18 << 1
                            )
                            << 14
                      )
                      & 65520
                  )
                  >> 4
                | (
                    (
                          (
                              ((((((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) & 0) >> 16 | (((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) << 0) + 18 & 32768) >> 15
                                | (((((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) & 0) >> 16 | (((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) << 0) + 18 << 1
                            )
                            & 65532
                        )
                        >> 2
                      | (
                          ((((((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) & 0) >> 16 | (((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) << 0) + 18 & 32768) >> 15
                            | (((((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) & 0) >> 16 | (((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) << 0) + 18 << 1
                        )
                        << 14
                  )
                  << 12
            )
            ^ 119
            ^ 213
            ^ 91
        );
        var19.setCharAt(
          var35,
          (char)(
            (
                (
                      (
                          (
                                (
                                    ((((((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) & 0) >> 16 | (((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) << 0) + 18 & 32768)
                                        >> 15
                                      | (((((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) & 0) >> 16 | (((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) << 0) + 18 << 1
                                  )
                                  & 65532
                              )
                              >> 2
                            | (
                                ((((((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) & 0) >> 16 | (((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) << 0) + 18 & 32768) >> 15
                                  | (((((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) & 0) >> 16 | (((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) << 0) + 18 << 1
                              )
                              << 14
                        )
                        & 65520
                    )
                    >> 4
                  | (
                      (
                            (
                                ((((((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) & 0) >> 16 | (((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) << 0) + 18 & 32768) >> 15
                                  | (((((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) & 0) >> 16 | (((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) << 0) + 18 << 1
                              )
                              & 65532
                          )
                          >> 2
                        | (
                            ((((((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) & 0) >> 16 | (((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) << 0) + 18 & 32768) >> 15
                              | (((((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) & 0) >> 16 | (((var60 & 'ﰀ') >> 10 | var60 << 6) ^ 18) << 0) + 18 << 1
                          )
                          << 14
                    )
                    << 12
              )
              ^ 119
              ^ 213
              ^ 91
          )
        );
      }

      Class var7 = Class.forName(var19.toString(), false, q.class.getClassLoader());
      switch ((var4 - 855289435 + 1773709826 + 636583995 - 1703267200 + 2130988731 + 484107592 ^ 1373701464 ^ 196376185 ^ 770002432) - 1112371788) {
        case 958318721:
          var10000 = var0.findConstructor(var7, var6);
          break;
        case 1207738295:
        case 2147374604:
          var10000 = var0.findVirtual(var7, var5, var6);
          break;
        case 2011275538:
          var10000 = var0.findSpecial(var7, var5, var6, q.class);
          break;
        case 2024703108:
          var10000 = var0.findStatic(var7, var5, var6);
          break;
        default:
          throw new UnsupportedOperationException("Unsupported handle type!");
      }
    }

    cot[((var10 ^ 1716078618 ^ 1345565859) - 829703583 - 1711963293 + 1582877765 ^ 1093506668) - 943610245 + 760973351 ^ 1386263893 ^ 946958772] = var10000;
    MethodHandle var11 = var10000.asType(var2);
    return new MutableCallSite(var11);
  }

  public static Object _/* $VF was: 1*/(Lookup var0, String var1, MethodType var2, Object... var3) {
    boolean var11 = false;
    int var10 = (Integer)var3[4];
    int var10001 = ((var10 + 808015877 + 1310953173 - 1775464143 + 575956930 ^ 470704198) - 1972887812 - 1569339620 ^ 737424633) - 133843037;
    MethodHandle var10000 = cot[((var10 + 808015877 + 1310953173 - 1775464143 + 575956930 ^ 470704198) - 1972887812 - 1569339620 ^ 737424633) - 133843037
      ^ 2087623935];
    if (cot[var10001 ^ 2087623935] == null) {
      int var4 = (Integer)var3[0];
      StringBuilder var14 = new StringBuilder((String)var3[1]);

      for (int var24 = -713429231 ^ -2047550714 & -1243717844 ^ 1353561109; var24 < var14.length(); var24 += 1687425737 << -603233073 ^ 157581313) {
        char var43 = var14.charAt(var24);
        char var46 = (char)(
          (
              (
                    (
                        (
                              ((((var43 & '耀') >> 15 | var43 << 1) + 205 - 235 ^ 67) + 76 & 49152) >> 14
                                | (((var43 & '耀') >> 15 | var43 << 1) + 205 - 235 ^ 67) + 76 << 2
                            )
                            - 73
                          ^ 156
                      )
                      & 65535
                  )
                  >> 0
                | (
                    (
                          ((((var43 & '耀') >> 15 | var43 << 1) + 205 - 235 ^ 67) + 76 & 49152) >> 14
                            | (((var43 & '耀') >> 15 | var43 << 1) + 205 - 235 ^ 67) + 76 << 2
                        )
                        - 73
                      ^ 156
                  )
                  << 16
            )
            - 102
        );
        var14.setCharAt(
          var24,
          (char)(
            (
                (
                      (
                          (
                                ((((var43 & '耀') >> 15 | var43 << 1) + 205 - 235 ^ 67) + 76 & 49152) >> 14
                                  | (((var43 & '耀') >> 15 | var43 << 1) + 205 - 235 ^ 67) + 76 << 2
                              )
                              - 73
                            ^ 156
                        )
                        & 65535
                    )
                    >> 0
                  | (
                      (
                            ((((var43 & '耀') >> 15 | var43 << 1) + 205 - 235 ^ 67) + 76 & 49152) >> 14
                              | (((var43 & '耀') >> 15 | var43 << 1) + 205 - 235 ^ 67) + 76 << 2
                          )
                          - 73
                        ^ 156
                    )
                    << 16
              )
              - 102
          )
        );
      }

      String var5 = var14.toString();
      StringBuilder var17 = new StringBuilder((String)var3[2]);

      for (int var30 = (-1368903225 - -1368903225 | 0) & -1541188219; var30 < var17.length(); var30 += (1063104528 & -1303801009 | 1) & -1004507645) {
        char var51 = var17.charAt(var30);
        char var56 = (char)(
          (
                (
                    (
                        (
                              (
                                    (((((var51 & 'ﾀ') >> 7 | var51 << '\t') & 57344) >> 13 | ((var51 & 'ﾀ') >> 7 | var51 << '\t') << 3) - 242 - 221 & 57344)
                                        >> 13
                                      | ((((var51 & 'ﾀ') >> 7 | var51 << '\t') & 57344) >> 13 | ((var51 & 'ﾀ') >> 7 | var51 << '\t') << 3) - 242 - 221 << 3
                                  )
                                  - 189
                                  + 228
                                & 65535
                            )
                            >> 0
                          | (
                                (((((var51 & 'ﾀ') >> 7 | var51 << '\t') & 57344) >> 13 | ((var51 & 'ﾀ') >> 7 | var51 << '\t') << 3) - 242 - 221 & 57344) >> 13
                                  | ((((var51 & 'ﾀ') >> 7 | var51 << '\t') & 57344) >> 13 | ((var51 & 'ﾀ') >> 7 | var51 << '\t') << 3) - 242 - 221 << 3
                              )
                              - 189
                              + 228
                            << 16
                      )
                      ^ 125
                  )
                  & 64512
              )
              >> 10
            | (
                (
                    (
                          (
                                (((((var51 & 'ﾀ') >> 7 | var51 << '\t') & 57344) >> 13 | ((var51 & 'ﾀ') >> 7 | var51 << '\t') << 3) - 242 - 221 & 57344) >> 13
                                  | ((((var51 & 'ﾀ') >> 7 | var51 << '\t') & 57344) >> 13 | ((var51 & 'ﾀ') >> 7 | var51 << '\t') << 3) - 242 - 221 << 3
                              )
                              - 189
                              + 228
                            & 65535
                        )
                        >> 0
                      | (
                            (((((var51 & 'ﾀ') >> 7 | var51 << '\t') & 57344) >> 13 | ((var51 & 'ﾀ') >> 7 | var51 << '\t') << 3) - 242 - 221 & 57344) >> 13
                              | ((((var51 & 'ﾀ') >> 7 | var51 << '\t') & 57344) >> 13 | ((var51 & 'ﾀ') >> 7 | var51 << '\t') << 3) - 242 - 221 << 3
                          )
                          - 189
                          + 228
                        << 16
                  )
                  ^ 125
              )
              << 6
        );
        var17.setCharAt(
          var30,
          (char)(
            (
                  (
                      (
                          (
                                (
                                      (((((var51 & 'ﾀ') >> 7 | var51 << '\t') & 57344) >> 13 | ((var51 & 'ﾀ') >> 7 | var51 << '\t') << 3) - 242 - 221 & 57344)
                                          >> 13
                                        | ((((var51 & 'ﾀ') >> 7 | var51 << '\t') & 57344) >> 13 | ((var51 & 'ﾀ') >> 7 | var51 << '\t') << 3) - 242 - 221 << 3
                                    )
                                    - 189
                                    + 228
                                  & 65535
                              )
                              >> 0
                            | (
                                  (((((var51 & 'ﾀ') >> 7 | var51 << '\t') & 57344) >> 13 | ((var51 & 'ﾀ') >> 7 | var51 << '\t') << 3) - 242 - 221 & 57344)
                                      >> 13
                                    | ((((var51 & 'ﾀ') >> 7 | var51 << '\t') & 57344) >> 13 | ((var51 & 'ﾀ') >> 7 | var51 << '\t') << 3) - 242 - 221 << 3
                                )
                                - 189
                                + 228
                              << 16
                        )
                        ^ 125
                    )
                    & 64512
                )
                >> 10
              | (
                  (
                      (
                            (
                                  (((((var51 & 'ﾀ') >> 7 | var51 << '\t') & 57344) >> 13 | ((var51 & 'ﾀ') >> 7 | var51 << '\t') << 3) - 242 - 221 & 57344)
                                      >> 13
                                    | ((((var51 & 'ﾀ') >> 7 | var51 << '\t') & 57344) >> 13 | ((var51 & 'ﾀ') >> 7 | var51 << '\t') << 3) - 242 - 221 << 3
                                )
                                - 189
                                + 228
                              & 65535
                          )
                          >> 0
                        | (
                              (((((var51 & 'ﾀ') >> 7 | var51 << '\t') & 57344) >> 13 | ((var51 & 'ﾀ') >> 7 | var51 << '\t') << 3) - 242 - 221 & 57344) >> 13
                                | ((((var51 & 'ﾀ') >> 7 | var51 << '\t') & 57344) >> 13 | ((var51 & 'ﾀ') >> 7 | var51 << '\t') << 3) - 242 - 221 << 3
                            )
                            - 189
                            + 228
                          << 16
                    )
                    ^ 125
                )
                << 6
          )
        );
      }

      Class var6 = Class.forName(var17.toString(), false, q.class.getClassLoader());
      StringBuilder var20 = new StringBuilder((String)var3[3]);

      for (int var36 = -1108363426 >> -1863793143 ^ -2164773; var36 < var20.length(); var36 += (1713484986 ^ 1356182133 | 0) & -1056784127) {
        int var61 = var20.charAt(var36) ^ 136;
        int var97 = (var61 & 65520) >> 4;
        int var62 = (var61 & 65520) >> 4 | var61 << 12;
        int var98 = (((var61 & 65520) >> 4 | var61 << 12) & 65024) >> 9;
        var61 = ((((var97 | var61 << 12) & 65024) >> 9 | ((var61 & 65520) >> 4 | var61 << 12) << 7) + 63 ^ 84) - 61;
        var97 = (((var98 | var62 << 7) + 63 ^ 84) - 61 & 65472) >> 6;
        int var64 = (((var98 | var62 << 7) + 63 ^ 84) - 61 & 65472) >> 6 | var61 << 10;
        int var100 = (((((var98 | var62 << 7) + 63 ^ 84) - 61 & 65472) >> 6 | var61 << 10) & 49152) >> 14;
        var61 = ((var97 | var61 << 10) & 49152) >> 14 | ((((var98 | var62 << 7) + 63 ^ 84) - 61 & 65472) >> 6 | var61 << 10) << 2;
        var97 = ((var100 | var64 << 2) & 65520) >> 4;
        int var66 = ((var100 | var64 << 2) & 65520) >> 4 | var61 << 12;
        int var102 = ((((var100 | var64 << 2) & 65520) >> 4 | var61 << 12) & 65535) >> 0;
        char var67 = (char)(((var97 | var61 << 12) & 65535) >> 0 | (((var100 | var64 << 2) & 65520) >> 4 | var61 << 12) << 16);
        var20.setCharAt(var36, (char)(var102 | var66 << 16));
      }

      Class var7 = MethodType.fromMethodDescriptorString(var20.toString(), q.class.getClassLoader()).returnType();
      switch ((((var4 ^ 573700821 ^ 896884075) - 1450487302 + 1102689 + 1167963490 ^ 2114682964) - 87787763 ^ 592999787) - 607397372 + 712070409) {
        case 254844502:
          var10000 = var0.findSetter(var6, var5, var7);
          break;
        case 1380025880:
          var10000 = var0.findStaticGetter(var6, var5, var7);
          break;
        case 1549965501:
          var10000 = var0.findStaticSetter(var6, var5, var7);
          break;
        case 1703543190:
          var10000 = var0.findGetter(var6, var5, var7);
          break;
        default:
          throw new UnsupportedOperationException("Unsupported handle type!");
      }
    }

    if (!var11) {
      cot[((var10 + 808015877 + 1310953173 - 1775464143 + 575956930 ^ 470704198) - 1972887812 - 1569339620 ^ 737424633) - 133843037 ^ 2087623935] = var10000;
    }

    MethodHandle var12 = var10000.asType(var2);
    return new MutableCallSite(var12);
  }
}
